README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>=let+=: destructuring extension of =let*=</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-05-23 17:30:22 CEST"/>
<meta name="author" content="Tamás K. Papp"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title"><code>let+</code>: destructuring extension of <code>let*</code></h1>

<p>This library implements the <code>let+</code> macro, which is a dectructuring
extension of <code>let*</code>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Highlights </a></li>
<li><a href="#sec-2">2 Similar libraries </a></li>
<li><a href="#sec-3">3 Syntax </a>
<ul>
<li><a href="#sec-3_1">3.1 Built-in forms: </a></li>
<li><a href="#sec-3_2">3.2 Convenience macros </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Extensions </a></li>
<li><a href="#sec-5">5 Reporting bugs </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Highlights </h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>
clean, consistent syntax and small implementation (less than 300 LOC, not counting tests)

</li>
<li>
placeholder macros allow editor hints and syntax highlighting

</li>
<li>
<code>NIL</code> for ignored values (in forms where that makes sense)

</li>
<li>
very easy to extend
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Similar libraries </h2>
<div class="outline-text-2" id="text-2">


<p>
This library was inspired by Gary King's excellent <a href="http://common-lisp.net/project/metabang-bind/">metabang-bind</a>.  I
have been using the latter for years now, pestering Gary with requests
for extensions from time to time which were always graciously
accommodated.  At some point I decided to write a library of my own,
aiming for a cleaner syntax, more conscise implementation and a more
consistent interface (whether I have succeeded is of course up to
judgement &mdash; try <a href="http://common-lisp.net/project/metabang-bind/">metabang-bind</a> to see if you like it better).
</p>
<p>
In my opinion the main advantages of this library, compared to
<a href="http://common-lisp.net/project/metabang-bind/">metabang-bind</a>, are the placeholder macros which provide editor hints
and the more consistent syntax of destructuring forms.  In particular,
when both read-write and read-only forms are available the latter
always have the <code>-r/o</code> suffix, <code>&amp;flet</code> and <code>&amp;labels</code> resemble the
Common Lisp syntax more closely, and the library should be easier to
extend.
</p>
<p>
You can find other pattern matching libraries on <a href="http://www.cliki.net/pattern matching">cliki</a>.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Syntax </h2>
<div class="outline-text-2" id="text-3">





<pre class="src src-lisp">let+ ({binding}*) body*
</pre>


<p>
where
</p>


<pre class="src src-lisp">binding <span style="color: #b0c4de;">::=</span> symbol || (form [init-form])
</pre>



<p>
<code>LET+</code> is recursive: each binding is in the scope of the previous
ones.  Some forms ignore <code>NIL</code> variables (see their documentation).  
</p>

</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Built-in forms: </h3>
<div class="outline-text-3" id="text-3_1">


<p>
Forms which provide both read-write and read-only access are
available as <code>&amp;form</code> and <code>&amp;form-r/o</code>.  The first one always uses
symbol macros, so you can use <code>setf</code>.  The second one reads the
values at the beginning of the list from value: you can change
these variables after that without having any effect on the
original value.  Read-only forms may also provide a slight increase
in speed, and promote good style &mdash; you can use them to signal
that you will not change the original structure.
</p>
<p>
The following forms are defined:
</p>
<dl>
<dt><code>var</code>, <code>(var)</code>, <code>(var value)</code></dt><dd>
These behave just like they do in <code>let*</code>.

</dd>
<dt><code>((&amp;slots slot*) value)</code>, also <code>&amp;slots-r/o</code></dt><dd>
Similarly to
<code>with-slots</code>, each <code>slot</code> has the syntax <code>variable</code>, <code>(variable)</code>
(for these, the variable name is also used for the slot name) or
<code>(variable slot-name)</code>.  <code>&amp;slots-r/o</code> provides read-only
bindings.

<p>
Example:
</p></dd>
</dl>





<pre class="src src-lisp">(<span style="color: #00ffff;">defclass</span> <span style="color: #98fb98;">foo-class</span> ()
  ((a <span style="color: #b0c4de;">:accessor</span> a <span style="color: #b0c4de;">:initarg</span> <span style="color: #b0c4de;">:a</span>)
   (b <span style="color: #b0c4de;">:accessor</span> b-accessor <span style="color: #b0c4de;">:initarg</span> <span style="color: #b0c4de;">:b</span>)))

(let+ (((<span style="color: #98fb98;">&amp;slots</span> a (my-b b)) (make-instance 'foo-class <span style="color: #b0c4de;">:a</span> 1 <span style="color: #b0c4de;">:b</span> 2)))
  (list a my-b))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (1 2)
</span></pre>



<dl>
<dt><code>((&amp;accessors accessor*) value)</code>, also <code>&amp;accessors-r/o</code></dt><dd>
Syntax
similar to <code>&amp;slots</code>.  Continuing the example above:
</dd>
</dl>





<pre class="src src-lisp">(let+ (((<span style="color: #98fb98;">&amp;accessors</span> a (b b-accessor)) (make-instance 'foo-class <span style="color: #b0c4de;">:a</span> 1 <span style="color: #b0c4de;">:b</span> 2)))
  (list a b))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (1 2)
</span></pre>



<dl>
<dt><code>((&amp;structure conc-name slot*) value)</code>, also <code>&amp;structure-r/o</code></dt><dd>

<p>
Slot access for structures.  <code>Conc-name</code> is prepended to the
accessors (you need to include the <code>-</code> if there is one).  Example:
</p></dd>
</dl>





<pre class="src src-lisp">(<span style="color: #00ffff;">defstruct</span> <span style="color: #98fb98;">foo-struct</span> c d)
(let+ (((<span style="color: #98fb98;">&amp;structure</span> foo-struct- c (my-d d)) (make-foo-struct <span style="color: #b0c4de;">:c</span> 3 <span style="color: #b0c4de;">:d</span> 4)))
  (list c my-d))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (3 4)
</span></pre>



<dl>
<dt><code>((&amp;values value*) form)</code></dt><dd>
Similar to <code>multiple-value-bind</code>. =NIL=s are ignored.  Example:
</dd>
</dl>





<pre class="src src-lisp">(let+ (((<span style="color: #98fb98;">&amp;values</span> a nil b) (values 1 2 3)))
  (list a b))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (1 3)
</span></pre>



<dl>
<dt><code>(array value)</code> (only read-only version)</dt><dd>
The array is
destructured to the given elements, =NIL=s are ignored.  Indexes
use row-major access, determined at macroexpansion time.
Example:
</dd>
</dl>





<pre class="src src-lisp">(let+ ((#(a nil b) (vector 1 2 3)))
  (list a b))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (1 3)
</span></pre>



<ul>
<li>
<code>((&amp;array-elements (variable subscript*)*) value)</code>, also
<code>&amp;array-elements</code> :: Array elements with given subscripts are
assigned to the variables.  Example:
</li>
</ul>





<pre class="src src-lisp">(let+ (((<span style="color: #98fb98;">&amp;array-elements</span> (a 0 1)
                         (b 2 0))
        #2A((0 1)
            (2 3)
            (4 5))))
  (list a b))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (1 4)
</span></pre>



<dl>
<dt><code>((&amp;flet name lambda-list forms*))</code>, also <code>&amp;labels</code></dt><dd>
Function
bindings.  These have no value form. <code>&amp;labels</code> allows the
function to refer to itself &ndash; note that since <code>let+</code> is always
recursive, this is the only difference between the two forms.
Example:
</dd>
</dl>





<pre class="src src-lisp">(let+ (((<span style="color: #98fb98;">&amp;flet</span> add2 (x)
          (+ x 2))))
  (add2 5))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; 7
</span></pre>



<dl>
<dt><code>((&amp;plist (variable key [default])*) =, also =&amp;plist-r/o</code></dt><dd>
Access
to property lists.  When <code>key</code> is <code>NIL</code>, <code>variable</code> is used
instead, and <code>default</code> is used if the element does not exist in
the value (note that default may be evaluated multiple times when
using the read-write form which uses <code>symbol-macrolet</code>).  Example:
</dd>
</dl>





<pre class="src src-lisp">(let+ (((<span style="color: #98fb98;">&amp;plist</span> a (my-b b) (c nil 3)) '(a 1 b 2)))
  (list a my-b c))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (1 2 3)
</span></pre>



<ul>
<li>
<code>(((&amp;hash-table (variable key [default])*)</code>, also
<code>&amp;hash-table-r/o</code> :: Access to the elements of hash tables, the
semantics is the same as <code>&amp;plist</code>.
</li>
</ul>


</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Convenience macros </h3>
<div class="outline-text-3" id="text-3_2">


<dl>
<dt><code>(defun+ name (argument*) form*)</code>, also <code>(lambda (argument*)      form*)</code></dt><dd>
Work like <code>defun</code> and <code>lambda</code>, but arguments are
destructured using <code>let+</code>.  Example:
</dd>
</dl>





<pre class="src src-lisp">(defun+ foo ((<span style="color: #98fb98;">&amp;plist</span> a b c) #(d e))
  (list a b c d e))

(foo '(a 1 b 2 c 3) #(4 5))  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; (1 2 3 4 5)
</span></pre>



<dl>
<dt><code>(defstruct+ name-and-options &amp;rest slot-descriptions)</code></dt><dd>
Extends
<code>defstruct</code> with destructuring forms understood by the <code>let+</code>
macros.  Example:
</dd>
</dl>





<pre class="src src-lisp">(defstruct+ interval left right)

(let+ ((interval (make-interval <span style="color: #b0c4de;">:left</span> 1 <span style="color: #b0c4de;">:right</span> 2))
       ((<span style="color: #98fb98;">&amp;interval</span> left right) interval))
  (incf right 10)
  interval)  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">=&gt; #S(INTERVAL :LEFT 1 :RIGHT 12)
</span></pre>




</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Extensions </h2>
<div class="outline-text-2" id="text-4">


<p>
Extending <code>let-plus</code> is very easy: if you want to use a form that
resembles a list, you just have to define a method for
<code>let+-expansion-for-list</code>.  There is a macro that helps you with that,
called <code>define-let+-expansion</code>.  If the library didn't have
<code>defstruct+</code>, we could define destructuring for the form <code>&amp;interval</code>
like this:
</p>



<pre class="src src-lisp">(<span style="color: #00ffff;">define-let+-expansion</span> (<span style="color: #98fb98;">&amp;interval</span> (left right))
  <span style="color: #ffa07a;">"LET+ expansion for &amp;interval."</span>
  `(let+ (((<span style="color: #98fb98;">&amp;structure</span> interval- left right) value))
     ,@body))
</pre>


<p>
Some highlights:
</p>
<ul>
<li>
this macro defines a "placeholder" macro <code>&amp;interval</code> that should
help with editor hints, but has no other purpose (it is not used in
the expansion),
</li>
<li>
the macro is anaphoric, capturing <code>value</code> (the value form) and
<code>body</code> (the body inside the <code>let+</code> form), you can customize both of
this using keyword arguments,
</li>
<li>
unless required otherwise, <code>value</code> is wrapped in <code>once-only</code>
preventing multiple evaluations of the same form.
</li>
</ul>


<p>
If you want to extend <code>let+</code> with forms that are not lists (eg like
the array syntax above), have a look at <code>let+-expansion</code>.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Reporting bugs </h2>
<div class="outline-text-2" id="text-5">


<p>
Please open an issue on Github for bugs.  Extensions are also welcome,
either as forks or small code snippets submitted as issues.  Wishlist
items are also welcome!
</p>
<p>
I ask you not to report bugs via e-mail if you can avoid it.  Tracking
bugs on Github makes it less likely that they get lost.
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Tamás K. Papp
</p>
<p class="date"> Date: 2011-05-23 17:30:22 CEST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
